[
  {
    "name": "Arts Appreciation",
    "category": "Arts & Cultural",
    "bio": "The club conducts regular activities to help members broaden their perspectives through appreciating all art forms, including field trips to museums and basic art classes. By bringing together likeminded people, the Arts Appreciation Club ensures you will always have a buddy to attend that film exhibition or watch a concert with.",
    "email": "cca_aarts@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "B-Boys",
    "category": "Arts & Cultural",
    "bio": "The B-Boy Dance Club performs under the alias of MightyNoMads. The club aims to spread the culture of hip-hop through B-Boying & B-Girling (Break Dancing), as well as to educate and nurture its members in the following four elements of B-Boying: ‘Top rock’, ‘Down rock’, freezes, and power moves. Weekly trainings are centred around fun and experiential learning, while improving individuals’ technical skills.",
    "email": "cca_bboys@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/bboys.jpg"
  },
  {
    "name": "Chinese Calligraphy",
    "category": "Arts & Cultural",
    "bio": "The Chinese Calligraphy Club aims to spread awareness of Chinese calligraphy among NP students. Through calligraphy and Chinese painting classes, students get to interact with various nationalities. They also learn to write elegant Chinese script and paint beautiful landscapes. Outstanding pieces of work may even be showcased and submitted for competitions.",
    "email": "cca_calligraphy@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/chinese_calligraphy.jpg"
  },
  {
    "name": "Chinese Dance",
    "category": "Arts & Cultural",
    "bio": "The Chinese Dance Club focuses on contemporary Chinese Dance and prides itself on being the only Chinese Dance Club among all the polytechnics in Singapore. The club aims to create awareness of this rich cultural art form by giving back to the community through public performances, both on and off campus.",
    "email": "cca_cdance@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/chinese_dance.jpg"
  },
  {
    "name": "Chinese Drama",
    "category": "Arts & Cultural",
    "bio": "The Chinese Drama Club is also known as the Stage Art Group (SAG), and involves Mandarin and Chinese Stage Art. They aim to expose and nurture acting potential within every member. Members also get involved in major aspects of stage production, from the basics of stage lighting and sound to making props and costumes, and even script writing and make up. The club has performed locally, as well as in Malaysian cities like Johor Bahru, Kuala Lumpur and Penang.",
    "email": "cca_cdrama@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/chinese_drama.jpg"
  },
  {
    "name": "Chinese Orchestra",
    "category": "Arts & Cultural",
    "bio": "The Chinese Orchestra Club aims to promote awareness of Chinese orchestral music. The orchestra participates actively in performances and takes part in no less than five events each year. The club’s conductor, Chuan Joon Hee, is an accomplished Huqin musician in Singapore and is currently a Zhonghu performer in the Singapore Chinese Orchestra.",
    "email": "cca_corchestra@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/chinese_orchestra.jpg"
  },
  {
    "name": "Concert Band Club",
    "category": "Arts & Cultural",
    "bio": "The club was started to encourage NP students formerly from secondary school bands to continue pursuing their passion in music. The club holds annual concerts, such as \"Ripieno\" with the Strings Club and \"Rondeau\" within the band, to share musical experiences with family, friends, and the NP community. As part of a holistic CCA experience, the club also offers band exchanges, competitions and annual outdoor performances for members to showcase their talents and skills.",
    "email": "cca_concert@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/concert_band.jpg"
  },
  {
    "name": "Contemporary Dance",
    "category": "Arts & Cultural",
    "bio": "The Contemporary Dance Club, also popularly known as D3, was founded in 2009, and is NP’s only contemporary Dance Club. D3 represents the three fundamental elements of a great dancer: dancing with passion, dancing with attitude, and dancing with your body, mind and soul. The club has participated in events such as \"United We Boogie (Singapore)\" and Youthphoria @ SDC.",
    "email": "cca_contemdance@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Dance Sport",
    "category": "Arts & Cultural",
    "bio": "As part of weekly trainings, the DanceSport club incorporates the 5 Latin dances: Chacha, Rhumba, Jive, Samba and Paso Doble. Whether you choose to dance socially or competitively, you’ll get to immerse yourself in the art of expression through the sensual allure of DanceSport.",
    "email": "cca_dancesport@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/dance_sport.jpg"
  },
  {
    "name": "Dragon And Lion Dance",
    "category": "Arts & Cultural",
    "bio": "As Lion Dance is traditionally believed to bring about prosperity and wards off evil spirits, companies hire lion dance troupes for various events and opening ceremonies. NP’s club also aims to introduce traditional Chinese culture to the NP community through appearances at ceremonies and events, so members get to experience what the profession entails.",
    "email": "cca_lion@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/dragon_lion_dance.jpg"
  },
  {
    "name": "English Drama",
    "category": "Arts & Cultural",
    "bio": "Established in the late 80’s, the English Drama Club, also known as the Poly Stage F'Actor, comprises highly dedicated and talented members who are passionate about theatre and the arts in general. The club’s annual event Musik Art! allows students to showcase their talent by performing original songs ranging from Progressive Rock to Punk Metal.",
    "email": "cca_edrama@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/english_drama.jpg"
  },
  {
    "name": "Entertainers",
    "category": "Arts & Cultural",
    "bio": "The Entertainers Club hopes to groom performers through events with a platform to showcase their skills and talents. Currently, the club focuses on two entertainment arenas: balloon sculpting and magic. The Magic Arena is open to all hobbyists of Magic, whether experienced or not, and the Balloon Sculpting Arena aims to groom interested parties to be balloon sculptors of high standards.",
    "email": "cca_entertainers@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/entertainers.jpg"
  },
  {
    "name": "Hip Hop",
    "category": "Arts & Cultural",
    "bio": "More popularly known as New Revolving Age (NRA), the hip hop club nurtures its dancers in various genres, such as Old School Hip Hop, New School Hip Hop, Jazz Funk, Street Jazz, Popping, Locking and Lyrical Jazz. The club is also known for its bi-annual dance production, Danzation.",
    "email": "cca_hiphop@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/hip_hop.jpg"
  },
  {
    "name": "Indian Cultural Society​",
    "category": "Arts & Cultural",
    "bio": "The Indian Cultural Society is a platform for NP students to showcase their talents and reinforce their knowledge of Indian Culture. Every year, the club produces two major productions:",
    "email": "",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/indian_cultural_society.jpg"
  },
  {
    "name": "Japanese Cultural​",
    "category": "Arts & Cultural",
    "bio": "The Japanese Cultural Club in Ngee Ann Polytechnic was founded in 1998. It has since expanded to 6 different divisions in 2018 consisting of Cultural, Comink, Cosplay & J-Fashion, Language, Taiko and Tea Ceremony. Our mission is to teach a variety of Japanese culture to students through slide sessions, games, quizzes, direct exposure of that culture and other fun activities like Japanese school exchanges!",
    "email": "cca_japanese@connect.np.edu.sg​\nFollow us on Instagram",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/japanese_cultural.jpg"
  },
  {
    "name": "Korean Cultural",
    "category": "Arts & Cultural",
    "bio": "The Korean Cultural Club (KCC) is the first Korean club in a Singaporean education institution, and has the endorsement and support of the Singapore Korean Embassy. KCC aims to raise awareness about Korean culture and gives NP students the opportunity to learn basic conversational Korean language. The club also comprises a Korean Pop dance group.",
    "email": "cca_korean@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Malay Cultural",
    "category": "Arts & Cultural",
    "bio": "The Malay Cultural Club (MCC) comprises 5 active department: Guys Dikir, Girls Dikir, Warisan Mandling (Dance), Sri Nadi (Drama), and language. Some notable productions of MCC include 'Piala Khatulistiwa' , an annual dikir competition, and 'Dinamis Seni', an annual production that showcases the different departments in MCC.",
    "email": "cca_malay@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/malay_cultural.jpg"
  },
  {
    "name": "Percussion",
    "category": "Arts & Cultural",
    "bio": "Baracuda Batucada is NP’s Percussion club. Since 2004, the samba ensemble has performed in various places, from campus events to larger venues like Orchard Road, Zouk, and even abroad in China. The club is also easily recognised by their hard-thumping rhythms heard around campus.",
    "email": "cca_percussion@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/percussion.jpg"
  },
  {
    "name": "Photography",
    "category": "Arts & Cultural",
    "bio": "Members will be taught the basics and technical know-how of photography and videography, including the appreciation of aesthetics. Through covering actual events, members get to explore various types of photography, such as Abstract, Portraits, People, Nature, Studio and Events. They also get to dabble in corporate videos and event videography.",
    "email": "cca_photography@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/photography.jpg"
  },
  {
    "name": "Piano",
    "category": "Arts & Cultural",
    "bio": "The Piano Club is more commonly known as Klavierensemble. The ensemble aims to raise the standard of piano playing in school and hopes to showcase the beauty and versatility of the piano. Members can join either the 'Debussy' group or the less experienced 'Mozart' group.",
    "email": "cca_piano@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/piano.jpg"
  },
  {
    "name": "Song Composing",
    "category": "Arts & Cultural",
    "bio": "Kick start your music or song writing career with the Song Composing Club. Focusing on English Pop/Rock music, members will be taught the essentials of song writing, including basic musical and compositional theory. Members are provided with their very own studio, exclusive to the club, for practice sessions and to experiment with music by themselves.",
    "email": "cca_song@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/song_composing.jpg"
  },
  {
    "name": "Stage Production",
    "category": "Arts & Cultural",
    "bio": "The Poly Stage Production (PSP) aims to expose its members to what lies behind the scenes of stage productions. Members will learn about backstage production and the handling of light and sound systems. PSP has assisted in campus concerts for local and international artists. The club also regularly provides support for campus performances and events of the other CCA clubs.",
    "email": "cca_stage@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Strings",
    "category": "Arts & Cultural",
    "bio": "The Strings Club aims to promote the appreciation of classical music amongst students. The club consists of 2 sections: Strings Ensemble and Guitar Ensemble. To increase the versatility of the club, the Strings Club hopes to adapt and infuse new genres, such as pop, into their music. The club is also actively involved in performing for various school and external events.",
    "email": "cca_strings@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/strings.jpg"
  },
  {
    "name": "Voices",
    "category": "Arts & Cultural",
    "bio": "Each singer in NP Voices learns to grow and flourish as performers, and gain appreciation of different genres of music in Chorale and A Capp​ella singing. Every year, NP Voices holds its biggest event: Grandioso. Other regular activities include in-school training camps and mini-concerts. Members can also participate in carolling during the Christmas season every year.",
    "email": "cca_voices@connect.np.edu.sg​​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/voices.jpg"
  }
]