[
  {
    "name": "BP-NP Mentoring",
    "category": "Community Service",
    "bio": "Founded to aid academically poor students in primary and secondary school, our members share life experiences with the less privileged students. They aim to grow the students’ interest in learning and help them become enterprising young leaders. BP-NP mentors currently serve in seven different institutions around Singapore.",
    "email": "cca_mentoring@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/bp_mentoring.jpg"
  },
  {
    "name": "Environmental Rangers Club",
    "category": "Community Service",
    "bio": "The club is an environmental group that hopes to instill a sens e of responsibility and passion in our members and the school population towards the environment. Through new and creative ideas to overcome environmental issues, we aim to transform the campus into a greener place to work and play.",
    "email": "cca_erangers@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/environmental_rangers.jpeg"
  },
  {
    "name": "Food Aid",
    "category": "Community Service",
    "bio": "The Food Aid club aims to help the less fortunate individuals and families who cannot afford to have sufficient food for themselves. We also aim to widen students' perspective on issues surrounding food through our community service programmes, such as liaising with other welfare organisations on fund-raising and food donation drives.",
    "email": "cca_foodaid@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/food_aid.jpg"
  },
  {
    "name": "Hi! Club",
    "category": "Community Service",
    "bio": "The Hi! Club aims to unite our hearing and non-hearing counterparts. Through sign language courses by dedicated instructors, our members understand the language and gain a passion for our cause. The club also engages in song signing and sign language drama performances for both school-based and external events.",
    "email": "cca_hi@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/hearing_impaired.jpg"
  },
  {
    "name": "Leo Club",
    "category": "Community Service",
    "bio": "The Leo Club serves a varying audience, from children to the elderly. Through projects and volunteer activities, the club provides development and contribution opportunities for youth, individually and collectively, to give back to the local, national and international community.",
    "email": "cca_leo@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "NP BB Primers\n",
    "category": "Community Service",
    "bio": "Established under the umbrella of The Boys' Brigade in Singapore, NP BB Primers are given numerous opportunities to develop and nurture their leadership abilities and character, from event planning to taking part in the National Day Parade as crowd motivators. The group also sets up booths around the campus and goes door-to-door in a designated residential area to appeal for food donations.",
    "email": "cca_primers@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/bb_Primers.jpeg"
  },
  {
    "name": "Red Cross Youth Chapter",
    "category": "Community Service",
    "bio": "Through working with the Singapore Red Cross Society, RCY members get various opportunities to develop their First Aid proficiency through courses. The chapter also organises blood donation drives on a tri-annual basis, and other Community Involvement Programme (CIP) opportunities, allowing members to give back to society.",
    "email": "cca_redcross@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/red_cross.jpg"
  },
  {
    "name": "Rotaract Club",
    "category": "Community Service",
    "bio": "The Rotaract Club of Ngee Ann Polytechnic is an institution-based service club dedicated towards community service, international understanding, and professional and personal development. The two guiding principles of the club are: ’Service Above Self' and 'Fellowship Through Service’. Rotaractors can expect a variety of activities ranging from fellowship camps to serving the elderly.",
    "email": "cca_rotaract@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  }
]