[
  {
    "name": "Aerobics",
    "category": "Sports",
    "bio": "The NP Aerobics Club caters to individuals of all fitness levels, from those who have not tried aerobics to those who already have their own exercise regime. Workouts include cardiovascular training, muscle strengthening and toning exercises, and strength and weight training.\n",
    "email": "cca_aerobics@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/aerobics.jpeg"
  },
  {
    "name": "Archery",
    "category": "Sports",
    "bio": "Since its inception in 1998, the Archery Club has won numerous medals in national-level competitions. Particularly skilled and passionate club members have also been a part of Singapore's National Team, or had the opportunity to represent the polytechnic in archery competitions and events.",
    "email": "cca_archery@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https: //www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/archery.jpg"
  },
  {
    "name": "Badminton",
    "category": "Sports",
    "bio": "The badminton club provides a great environment for recreational players who want to improve their skills by sparring matches and workouts. The club also provides leadership training, in the form of planning and management. The club is the executive organiser of tournaments, such as the Inter-Club Badminton Competition, as well as Intra-School badminton competitions like NP Open, NP Doubles and Polympics.",
    "email": "cca_badminton@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/badminton.jpg"
  },
  {
    "name": "Basketball",
    "category": "Sports",
    "bio": "The Ngee Ann Basketball Club is one of the ranked institutes in the Inter-Varsity Championships. Interested members are welcome to join the club for try-outs and training sessions. The club also conducts annual camps and friendly matches outside of training time.",
    "email": "cca_basketball@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/basketball.jpg"
  },
  {
    "name": "Bowling",
    "category": "Sports",
    "bio": "The Bowling Club aims to develop and train members in bowling. They believe it is a game played with cunning strategy, mental strength, and keen teamwork. The club is open to individuals of any experience level.",
    "email": "cca_bowling@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/bowling.jpg"
  },
  {
    "name": "",
    "category": "Sports",
    "bio": "The Canoeing Club trains intensely in two main groups: Canoe Polo and Canoe Sprinting. The first is a competitive sport that is a mix of basketball and water polo on kayaks. The latter consists of canoe marathons and sprinting competitions that test your strength and endurance. Sprinting boats are built differently from Canoe Polo boats and can achieve greater speeds.",
    "email": "cca_canoeing@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/canoepolo.jpg"
  },
  {
    "name": "Climbing Club\n",
    "category": "Sports",
    "bio": "The Climbing Club specialises in adventure racing and rock climbing. Adventure Racing is a multi-discipline endurance 'sport', with elements from various other adventure sports thrown into the mix. Under Rock Climbing, the club focuses on top rope climbing, speed climbing, bouldering and lead climbing. The club also has their own tower, equipped with climbing lanes, abseil lanes, flying fox, and various low elements.",
    "email": "cca_climbing@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Cue Sports",
    "category": "Sports",
    "bio": "With cue sports, it’s all about skills, precision and strategy. Cue sports is a billiard game that is played using 22 balls – one cue ball, 15 red balls, and 6 different coloured balls with different point valuations. Members will learn to master the game and become better competitive or recreational players.",
    "email": "cca_snooker@connect.np.edu.sg\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/cue_sports.jpg"
  },
  {
    "name": "Dragon Boat",
    "category": "Sports",
    "bio": "The Dragon Boat Club (NPDB) carries an illustrious history, coupled with a fierce reputation for determination and strength in the Singapore Dragon Boat fraternity. The team participates in international regattas and races, such as the Malaysian Dragon Boat Regatta, and in non-dragon boat events like 'Surf & Sweat' that help to foster team spirit and co-operation.",
    "email": "cca_dragonboat@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Fencing",
    "category": "Sports",
    "bio": "The Fencing Club exercises both the mind and the body. New members have the opportunity choose which weapon group they are most comfortable with. The club participates in the annual Novices and Fencing Singapore (FS) competitions and the Inter-School Fencing Invites.",
    "email": "cca_fencing@connect.np.edu.sg​​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/fencing.jpg"
  },
  {
    "name": "Floorball​\n",
    "category": "Sports",
    "bio": "Floorball may be one of Singapore's youngest sports, but NP Floorball has a competitive team that takes part in Polytechnic-ITE (POL-ITE) and Inter Varsity Polytechnic (IVP) competitions. These help players gain exposure and experience.The club also organises training and bonding camps and gatherings.",
    "email": "cca_floorball@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https: //www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/floorball.jpg"
  },
  {
    "name": "Football",
    "category": "Sports",
    "bio": "NP’s Football club gives students the opportunity to develop both as a football player and an individual. They believe in pushing each member to their fullest potential and endeavouring to be the best. The team’s passion and hard work has brought them success in the POL-ITE and Institute-Varsity-Polytechnic games.",
    "email": "cca_football@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/football.jpg"
  },
  {
    "name": "Futsal",
    "category": "Sports",
    "bio": "The sport emphasises more technical footwork and ball skills than soccer, and is a good platform for soccer players to develop ball control, ball handling, and patience. It is a variation of football with similar rules, but is played on a hard court.",
    "email": "cca_futsal@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Handball",
    "category": "Sports",
    "bio": "Handball is a fast-paced and dynamic contact sport that requires athleticism, strength and teamwork. The NP Handball club came in 1st runner up in the POL-ITE Games in 2011 and emerged champions in 2012. The club also offers opportunities for members to polish their skills in regular friendly matches and tournaments.",
    "email": "cca_handball@connect.np.edu.sg​​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/captainsball.jpg"
  },
  {
    "name": "Hockey",
    "category": "Sports",
    "bio": "The Hockey Club strives to do well in the POL-ITE and Inter-Varsity tournaments every year, and considers that their benchmark in competitive success. The club welcomes students who are interested in picking up hockey for recreation or looking to become more competent sportsmen and sportswomen. They also organise friendly matches with other schools and clubs.",
    "email": "cca_hockey@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Inline Skating",
    "category": "Sports",
    "bio": "The Inline Skating Club is home to a sport of finesse and strength — roller-skating. The two aspects they focus on are slide and slalom. Under slide, skaters position their legs differently to execute various slides, while in slalom, skaters manoeuvre through a line of cones while performing tricks.",
    "email": "cca_inline@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/inline_skating.jpg"
  },
  {
    "name": "Judo",
    "category": "Sports",
    "bio": "Judo teaches the principle of flexibility in the application of technique. It cultivates self-discipline and respect for oneself and others, by providing the means for concentration and physical coordination, power and flexibility. Training sessions include practising throws and groundwork, learning new techniques, and tandoori (free practice).",
    "email": "cca_judo@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Lifesaving\n",
    "category": "Sports",
    "bio": "The main aim of the NP Lifesaving corps is to prevent the loss of life and promote the safe participation in water related pursuits. The team trains for internationally recognised lifesaving awards, as well as participates in annual lifesaving competitions like NUS Lifesaving Invitational and SLSS National Lifesaving Championships.",
    "email": "cca_lifeguard@connect.np.edu.sg​​\n",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Muay Thai",
    "category": "Sports",
    "bio": "Requiring dedication and a spirit that embraces learning, the club focuses on San Da and Muay Thai: San Da, also known as Chinese Kickboxing, encourages the use of slamming and wrestling, while Muay Thai, referred to as “The Art of the Eight Limbs”, extensively utilises elbows and knees.",
    "email": "cca_muaythai@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/muay_thai.jpg"
  },
  {
    "name": "Netball",
    "category": "Sports",
    "bio": "As the only all-female sports club in NP, the netball club is se parated into two teams: competitive team and recreational. The competitive team trains twice a week to prepare themselves for two key competitions held each year. The recreational team trains once a week, and are encouraged to participate to the fullest in organised friendly matches.",
    "email": "cca_netball@connect.np.edu.sg​​​\n",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Outdoor Adventure Club",
    "category": "Sports",
    "bio": "The Outdoor Adventure Club (ODAC) aims to make safe and enjoyable adventure available to the masses. Members with adventurous pursuits are able to polish their technical and non-technical skills through certified courses, skill-based camps and events that are skewed towards developing a strong mental tenacity and physical fitness.",
    "email": "cca_odac@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Rugby",
    "category": "Sports",
    "bio": "The Rugby Club aims to promote rugby as a gentlemen's game to students. The club also attracts top players from various local and national rugby clubs. Besides maintaining the highest standards on the pitch, the Rhinos’ camaraderie and fighting spirit is also evident from the various friendly tournaments, camps and bonding sessions.",
    "email": "cca_rugby@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Sailing",
    "category": "Sports",
    "bio": "Through training methods that emphasise team dynamics and good sportsmanship, the club aims to build a sailing team that is dedicated and disciplined. The club also hopes to enrich students’ lives by cultivating a strong sense of unity and belonging. They train twice a week to prepare for prestigious races, such as the Pesta Sukan Regatta and Changi Regatta.",
    "email": "cca_sailing@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Silat",
    "category": "Sports",
    "bio": "NP Silat focuses on teaching 'tanding' (match sparring) techniques to its members. However, during season trainings, members will get to choose to join the standing category or the 'seni' (artistic) category for competitions. The club has done the school proud in many competitions, most notably the Inter-Varsity and POL-ITE games.",
    "email": "cca_silat@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/silat.jpg"
  },
  {
    "name": "Shooting",
    "category": "Sports",
    "bio": "As the sole shooting club among the polytechnics to date, the club aims to pave the way for the Shooting Sport at the Polytechnic level. The club focuses on the 10-meter Air Rifle and 10-meter Air Pistol as classifications.",
    "email": "cca_shooting@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/shooting.jpg"
  },
  {
    "name": "Softball",
    "category": "Sports",
    "bio": "With a strong emphasis on extensive teamwork, cooperation and communication between members, softball is an ideal sport for those keen on trying out a new and challenging sport. The club also encourages members to share their experience, knowledge and passion for the sport with fellow softball maniacs.",
    "email": "cca_softball@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/softball.jpg"
  },
  {
    "name": "Squash",
    "category": "Sports",
    "bio": "The squash club gives players both physical and mental training. Numerous drills and types of play are implemented during training sessions to help players improve and increase their fitness levels. The club aims to gather students of all experience levels to play the sport, either for recreation, exercise, or competition.",
    "email": "cca_squash@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Swimming",
    "category": "Sports",
    "bio": "With over 10 years of history, the Ngee Ann Swim Team has established itself as more than just a sports CCA. Training is not just filled with laps of monotonous stroke work, but also aims to develop competitive individuals. Through annual competitions, swimmers hone their skills and experience.",
    "email": "cca_swimming@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/swimming.jpg"
  },
  {
    "name": "Table Tennis",
    "category": "Sports",
    "bio": "The Table Tennis club aims to help members discover their interest and unleash their fullest potential. Catering to both recreational and competitive players, the latter vie for 10 to 12 positions to represent the school in tournaments. The club also organises camps for members to improve their skills to prepare them physically and mentally for competitions.",
    "email": "cca_tabletennis@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Taekwondo",
    "category": "Sports",
    "bio": "Taekwondo, 태권도 , is a traditional Korean martial art form which combines combat techniques, self-defence, discipline, sport, exercise, meditation and philosophy. Members will get a chance to learn different sparring techniques and utilise it in our contact sparring sessions. Every three months, members go for pattern grading to upgrade their belt level.",
    "email": "cca_tkd@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Tchoukball",
    "category": "Sports",
    "bio": "Tchoukball is a fast-paced invasion sport and is played recreationally and competitively in the club. Members get to experience a unique form of teamwork and pick up ball handling and throwing techniques. They also develop speed, agility and reaction skills while improving fitness levels.",
    "email": "cca_tchouk@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Tennis",
    "category": "Sports",
    "bio": "The Tennis Club consistently serves up the aces in the inter POL-ITE games and varsity tournaments. Members learn to correct common mistakes, sharpen their focus and strengthen their determination. They also master the techniques, improve stamina and cultivate the mental perseverance to sustain a tennis match.",
    "email": "cca_tennis@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Touch Rugby\n",
    "category": "Sports",
    "bio": "Touch Rugby training is designed to make one confident by imparting good skills and technique. Through regular training sessions, members are able to constantly improve their skills. In addition, to gain experience and exposure, the club organises friendlies with other schools and participates actively in carnivals such as the Winter Touch League (WTL) and the M1 School Rugby Series.",
    "email": "cca_touchrugby@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/touch_rugby.jpg"
  },
  {
    "name": "Track and Field",
    "category": "Sports",
    "bio": "NP Track and Field trains for a multitude of disciplines, from throws to short distance sprints, and even middle distances. Besides national level competitions like the POL-ITE games and inter-varsity tournaments, the club also participates in local track meets for members to gain competition experience.",
    "email": "cca_track@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Ultimate Frisbee",
    "category": "Sports",
    "bio": "From hand-eye coordination found in basketball, to skilful team-play found in football, to accurate passes found in hockey, ultimate frisbee has it all. The club aims to spread awareness of Ultimate Frisbee, and welcomes students of all experience levels.",
    "email": "cca_frisbee@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Volleyball\n",
    "category": "Sports",
    "bio": "The volleyball club holds training camps at the end of each year to provide campers a more intensive and detailed training, as well as organises inter-club and inter-school competitions such as Polympics. Aside from the club’s recreational aspect, the club also represents NP in inter-varsity competitions.",
    "email": "cca_volleyball@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/volleyball.jpg"
  },
  {
    "name": "Water Polo",
    "category": "Sports",
    "bio": "Water Polo is a fast-paced sport where tactics, teamwork, an alert mind, hand to eye coordination and fitness work hand in hand. Over the last few years, the Water Polo Club has brought the game to a whole new level in the polytechnic fraternity by winning gold in POL-ITE games.",
    "email": "cca_waterpolo@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Wushu​\n",
    "category": "Sports",
    "bio": "The Wushu club aims to promote the martial arts through opportunities for achievement and self-satisfaction. The club offers its members a good mix of traditional, free-style and international routines, and its members have participated in several Wushu competitions and championships at both tertiary and national level.",
    "email": "cca_wushu@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/wushu.jpg"
  },
  {
    "name": "Yoga",
    "category": "Sports",
    "bio": "Yoga is a sport that unites and balances your body, mind and breathing. In weekly practices, members will learn asanas (postures), pranayama (ways of breathing) and brush up on knowledge about yoga. The club welcomes students of all religion, gender and background.",
    "email": "cca_yoga@connect.np.edu.sg​\n",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/yoga.jpg"
  }
]