[{"name": "Band", "category": "Performing Arts CCAs", "bio": "The Temasek Polytechnic Band (TP Band) performs a wide repertoire of concert music from classical and pop arrangements to movie soundtracks. The rich blend of woodwind, brass and percussion instruments will surely leave audiences at the edge of their seats. Under the baton of conductors Mr Tan Beng Wee and Mr Ignatius Wang, they have actively been contributing to the vibrant arts scene on and off campus since the establishment of the polytechnic in 1990. TP Band is a platform for all budding, talented young musicians to develop their musicianship and performance capabilities.", "email": "nigeltan@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/band.jpg"}, {"name": "Chinese Orchestra", "category": "Performing Arts CCAs", "bio": "The Chinese Orchestra performs Chinese music using various Chinese instruments such as the Yangqin, Erhu and Pipa to explore the world of traditional and contemporary Chinese music. The elegant and soulful music presented by the Chinese Orchestra will enchant and enthral the audience. The orchestra collaborates with other CCAs such as Band and String Ensemble and also ventures out for public performances and overseas exchange programmes.", "email": "sokpeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/chinese_orchestra.jpg"}, {"name": "Chorale", "category": "Performing Arts CCAs", "bio": "The Temasek Polytechnic Chorale performs choral and acappella arrangements in conventional as well as contemporary styles. Let the singers bring music to your ears with the human instrument – the voice. TP Chorale is a renowned choir CCA group comprising a diverse group of Sopranos, Altos, Tenors and Basses, led by their resident conductor, Ms Susanna Pua. They are bonded by their strong passion for singing and endeavour to convey their love for choral singing through the specially curated concert repertoire.", "email": "nigeltan@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/chorale.jpg"}, {"name": "Dance Ensemble (Modern, Hip Hop & BBoys)", "category": "Performing Arts CCAs", "bio": "TP Dance Ensemble (TPDE) comprises 3 main dance genres; Hip Hop, Modern Dance & Breakin’. Modern Dance is a dance form developed from classical ballet in the early 20th century, shedding the classical ballet technique, costume and shoes. Hip Hop is a popular dance style involving energetic & funky street dance. Breakin’ includes a multitude of different floorwork & explosive movements. Dance Ensemble’s Hip Hop, Modern Dance & Breakin’ are under the tutelage of Ahmad Kamil, Nikki Chan and Gerald Chan respectively.", "email": "sokpeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/dance_ensemble.jpg"}, {"name": "Digital Media and Production Crew", "category": "Performing Arts CCAs", "bio": "Digital Media & Production Crew forms the backbone of all performing arts groups by providing extensive technical support. Other than providing the essentials such as lighting, sound, video, stage management, photography, videography and front-of-house, they also organise campus-wide events such as the annual DREAMS Concert.", "email": "sokpeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/digital_media.jpg"}, {"name": "Dikir Barat", "category": "Performing Arts CCAs", "bio": "Temasek Polytechnic (TP) Dikir Barat is a vibrant traditional Malay art form that involves 15 or more people doing responsorial singing, led by a couple of lead singers and accompanied by Malay percussions. It is a traditional art form anchored in the use of poetry and creative lyrics. TP Dikir takes part in numerous high-level, poly-wide and external public performances. TP Dikir has recently won multiple awards at the annual national competitions such as \"Piala Suara Serumpun\" (Cluster of Voices Trophy).", "email": "chrislee@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/dikir_barat.jpg"}, {"name": "Fusion Percussion", "category": "Performing Arts CCAs", "bio": "Temasek Polytechnic Fusion Percussion (TPFP) is a highly-spirited group of passionate individuals with a deep interest for percussive music. A collective of vibrant, creative and talented drummers come together in an explosive ensemble. Their shows are always exciting and full of energy. Get them to liven up shows and they will deliver the party to your doorstep! They live by their slogan “with a burning passion, we play to the beat of our hearts”. Brazilian Samba forms the cornerstone of TPFP's creative rhythms such as, Samba Temasek - a fusion of Brazilian samba and Singapore elements.", "email": "nigeltan@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/fusion_percussion.jpg"}, {"name": "Indian Dance", "category": "Performing Arts CCAs", "bio": "Temasek Polytechnic (TP) Indian Dance Group (IDG) trains in the various dance forms such as Bharatha-Natyam, Bollywood, folk and semi-classical Indian dance forms. IDG's members do their own choreography and have been featured at various major events. IDG promotes and showcases its colourful and enthralling dance forms and charming performances, leaving the audience asking for more.", "email": "chrislee@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/indian_dance.jpg"}, {"name": "Malay Dance", "category": "Performing Arts CCAs", "bio": "TP Malay Dance Group is also called Kesenian Si Anak Tari (Seni Nak Tari or SNT). SNT takes pride in promoting the arts and providing high-quality traditional and contemporary performances. Featuring both traditional and contemporary styles, SNT’s movements are enhanced by their elaborate costumes and accessories, showcasing the rich heritage of the various genres portrayed.", "email": "chrislee@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/malay_dance.jpg"}, {"name": "Music Vox", "category": "Performing Arts CCAs", "bio": "TP Music Vox is a family of jam bands, typically made up of vocals, guitars, bass, keyboards and drums, which play assorted genres including pop, rock and indie of original and cover music. The bands are often invited to perform for events on and off campus such as DREAMS Concert and Temasek Spectacular, having been recognised for their musical synergy and crowd appeal. Music Vox is a family of like-minded individuals with a strong passion for music, performing and recording.", "email": "nigeltan@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/music_vox.jpg"}, {"name": "Salvo Drums", "category": "Performing Arts CCAs", "bio": "The Salvo Drums brings to life any stage with their performances using the world’s most ancient instrument – the drum, specifically, the 24-season drums. Teamwork, with disciplined training, plays a vital role for the drummers in displaying their powerful percussive strokes in choreographed synchronised movements. Salvo Drums has also experimented through a variety of themes to enhance the vibrancy and creativity of its performances, immersing the audience with different experiences.", "email": "sokpeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/salvo_drums.jpg"}, {"name": "String Ensemble", "category": "Performing Arts CCAs", "bio": "The String Ensemble performs pieces from a range of genres, from classical to modern pop music. A string instrument’s sound and timbre can greatly vary depending on how it is played, thus this allows for many possibilities when it comes to music arrangement and ways for members to express themselves.", "email": "sokpeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/string_ensemble.jpg"}, {"name": "Teatro", "category": "Performing Arts CCAs", "bio": "Teatro, which means Theatre in Spanish, is a conglomerate of TP's English and Malay drama groups. Teatro engages their audience with high quality skits and staged productions. Being one of the most versatile groups, Teatro scripts and stages drama according to the occasion, fusing various art forms to engage the audiences. Teatro stages theatre performances every year. Keep a look out for their exciting theatrical productions at the TP Black Box!", "email": "chrislee@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/teatro.jpg"}, {"name": "TP Emcees", "category": "Performing Arts CCAs", "bio": "TP Emcees is a fun and lively community of emcees who provide hosting services to the student body of Temasek Polytechnic. They assist with the facilitation of events through collaboration with the various school departments and CCA groups. Parties that they work with include the Arts Groups, P10 & Interest Groups, the academic schools, Corporate Communications and the Student Development and Alumni Affairs departments. The TP Emcees have hosted a variety of event types, from formal ones to less formal community service events and also multiple online platforms. Come be part of the TP Emcees family if you feel at ease on stage and love meeting crowds of people.", "email": "aidli@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/performing-arts/tp_emcees.jpg"}, {"name": "10 Pin Bowling", "category": "Sports CCAs", "bio": "In recent years, this popular sport has gained a strong following in Singapore among secondary and tertiary students. Similarly, the TP Bowling Team (Men & Women) attracts all levels of bowlers, and our best bowlers compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Games annually.", "email": "hengnuan@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/10_pin_bowling.jpg"}, {"name": "Aikido", "category": "Sports CCAs", "bio": "Aikido is a modern Japanese martial art that was developed for defence while minimising injury for the attacker. Aikido techniques use the attacker’s momentum and turn them into various throws or joint locks.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/aikido.jpg"}, {"name": "Archery", "category": "Sports CCAs", "bio": "Competitive archery involves shooting arrows at a target for accuracy over several set distances. TP Archery Team competes in the Polytechnic-ITE (POL-ITE) Archery Games and external competitions annually.", "email": "julianqj@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/archery.jpg"}, {"name": "Badminton", "category": "Sports CCAs", "bio": "Another common and popular racquet sport, badminton requires aerobic stamina, agility, strength, speed and precision. The common forms of the game are \"singles\" (with one player per side) and \"doubles\" (with two players per side). TP Badminton Teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Badminton Games annually.", "email": "wkkoh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/badminton.jpg"}, {"name": "Basketball", "category": "Sports CCAs", "bio": "Competitive basketball is another popular team sport in which two competing teams of 5 players play on a rectangle court to try and outscore each other through the basketball hoops at opposing ends. TP Men’s and Women’s Basketball teams compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Games annually.", "email": "joncsw@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/basketball.jpg"}, {"name": "Dragon Boat", "category": "Sports CCAs", "bio": "Originating from China, dragon boat racing is a human-powered boat sport. For competitive events, dragon boats are generally rigged with decorative and colorful Chinese dragon heads and tails. In races, there are 18-20 people in a standard boat, and 8-10 in a small boat, excluding steersperson and the drummer. The dragon boat races are the highlight of Week Zero activities in our annual Temasek Polytechnic Regatta. TP Dragon Boat Teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) Dragon Boat Race and external competitions annually.", "email": "ngqihui@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/dragon_boat.jpg"}, {"name": "Field Hockey", "category": "Sports CCAs", "bio": "Field hockey is played on natural grass and artificial turf with a small, hard ball. The game is popular in numerous parts of the world, particularly in Europe, Asia, Australia and New Zealand. In Singapore, the sport is very well supported at the secondary and tertiary levels. TP Hockey teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) Hockey Games annually.", "email": "tants@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/field_hockey.jpg"}, {"name": "Floorball", "category": "Sports CCAs", "bio": "Developed in Scandinavia in the 1970s, floorball is a fast-paced sport played indoors with ’plastic’ sticks and a ball. Playing the stick above the waist is also against the rules, making it a relatively safe sport. Each game comprises three periods of 15 minutes and involves five players and a goalkeeper with rotating substitutions. TP Floorball teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Floorball Games annually.", "email": "tants@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/floorball.jpg"}, {"name": "Handball", "category": "Sports CCAs", "bio": "Handball is a team sport in which two teams of six outcourt players and one goalkeeper pass the ball around with the objective of throwing it into the goal of the opposing team. The game consists of two halves of 30 minutes each and the team with the most goals at the end of the game wins the match. TP Handball (Men) team competes in external competitions annually.", "email": "waifann@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/handball.jpg"}, {"name": "Inline Skating", "category": "Sports CCAs", "bio": "A pair of skates is portable, versatile and can be used to skate on any hard surface. Inline skating allows freedom of movement and allows the skater to maneuver the body to perform skating movements and tricks. The sport improves balance, and strengthens the upper and lower body muscles.", "email": "limap@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/inline_skating.jpg"}, {"name": "Judo", "category": "Sports CCAs", "bio": "Judo is a combat martial art founded in Japan and has evolved into an Olympic sport. Two judo practitioners, also known as Judoka, will step into a combat ring with the objective of throwing or taking down the opponent, immobilise an opponent with a pin or force an opponent into submission with a choke or joint lock. TP Judo team competes in external competitions annually.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/judo.jpg"}, {"name": "Karate", "category": "Sports CCAs", "bio": "Karate is a martial art developed in Japan under the influence Chinese Kung Fu. A karate practitioner is called a karateka and the aim is to master the art of punching, kicking, knee strikes, elbow strikes and open-hand techniques such as knife-hands, palm-heel hands and spear hands. TP Karate team competes in external competitions annually.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/karate.jpg"}, {"name": "Kayak Racing", "category": "Sports CCAs", "bio": "Kayak racing is a water sport growing in popularity. The first kayaks were made of driftwood and animal skins by the natives of Asia and North America. Modern kayaks are made of metal, fiberglass and rubber, making them stronger, more durable and portable. TP Kayak Racing team competes in the Polytechnic-ITE (POL-ITE) Canoe Sprints and external competitions annually.", "email": "julianqj@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/kayak_racing.jpg"}, {"name": "Life Saving", "category": "Sports CCAs", "bio": "Lifesaving is a unique sport, where the skills are developed primarily for humanitarian purposes and applied for competition. The sport provides a platform for lifeguards to come together to develop their skills in drowning prevention and attending to water-related injuries. It involves a  myriad of simulated scenarios such as swimming to a submerged manikin, bringing the manikin to the surface and swimming to the edge of the pool. To get involved in the sport, a person needs a Bronze Medallion certification.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/life_saving.jpg"}, {"name": "Mind Sports", "category": "Sports CCAs", "bio": "The mind sport is a board game of strategy for two players. As opposed to physical exercise, the competition is based on strategy and endgame methods. The common board games played in TP are Xiangqi and International Chess. TP Mind Sports team participates in external competitions annually.", "email": "tanyh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/mind_sports.jpg"}, {"name": "Netball", "category": "Sports CCAs", "bio": "Netball is a popular ball sport played by two teams of seven players each. The objective of the game is for teams to score by shooting into the goal ring. Unique to the game, players are assigned specific roles and move around within the restricted areas on court to maintain or gain possession of the ball. TP Netball team competes in the Polytechnic-ITE (POL-ITE) Games and Institute-Varsity Polytechnic (IVP) Games annually.", "email": "echok@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/netball.jpg"}, {"name": "Rugby", "category": "Sports CCAs", "bio": "Rugby is a robust, contact sport. The ball is not permitted to be passed forward. Traditionally, the game consists of 15 players per team. In recent years, 7-a-side games are introduced to inject more pace, fun and excitement into the sport. TP Rugby Team competes in the Polytechnic-ITE (POL-ITE) Rugby Games annually.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/rugby.jpg"}, {"name": "Silat", "category": "Sports CCAs", "bio": "Silat is an indigenous martial arts form that is widely practiced in Southeast Asia. Often known as Pencak Silat, the focus of the martial art is on a combination of strikes and joint manipulation. Pencak Silat was recently recognised by UNESCO as an intangible cultural heritage. TP Silat team competes in external competitions annually.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/silat.jpg"}, {"name": "Soccer", "category": "Sports CCAs", "bio": "The sport that needs no introduction. Commonly known in this region as football, the game is estimated to be played by over 250 million players in over 200 countries, making it the world’s most popular sport. TP Soccer teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) Soccer Games and SR Nathan Challenge Trophy Soccer Tournament annually.", "email": "tanyh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/soccer.jpg"}, {"name": "Sport Climbing", "category": "Sports CCAs", "bio": "There are three forms of sport climbing – bouldering, lead climbing and speed climbing. The team mainly practices bouldering, which is a form of climbing performed on small rock structures without the use of ropes or harnesses and is mainly conducted indoors. TP Sport Climbing team competes in the Polytechnic-ITE (POL-ITE) Sport Climbing (Bouldering) Championship annually.", "email": "edwink@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/sport_climbing.jpg"}, {"name": "Swimming", "category": "Sports CCAs", "bio": "Swimming is the second most popular exercise activity in Singapore and is one of the most popular Olympic sports. Swimming requires the use of one's entire body to move through water. For competition, the swimming events generally consists of butterfly, backstroke, breaststroke, freestyle and individual medley. Swimming is good for physical health as it burns lots of calories, is easy on the joints, supports your weight, builds muscular strength and endurance. TP Swimming teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Swimming Championship annually.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/swimming.jpg"}, {"name": "Table Tennis", "category": "Sports CCAs", "bio": "Table tennis, also known as ping-pong, is another familiar sport in Singapore. Play is fast and demands quick reactions and movements, making it an exciting sport to watch as well. TP Table Tennis Teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Table-Tennis Games annually.", "email": "wkkoh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/table_tennis.jpg"}, {"name": "Taekwondo", "category": "Sports CCAs", "bio": "Taekwondo is the oldest Korean martial art and is still included in the Korean military training today. Taekwondo competitions involve poomsae, a set of defined pattern defence and attack techniques, and kyorugi, which involves sparring with an opponent. TP Taekwondo Team competes in the Polytechnic-ITE (POL-ITE) Taekwondo Games and external competitions annually.", "email": "joncsw@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/taekwondo.jpg"}, {"name": "Tchoukball", "category": "Sports CCAs", "bio": "Tchoukball is an indoor team sport developed in the 1970s that is non-aggressive (non-contact and no intercept of passes) and reduces incidence of injuries while enabling people from all walks of life to enjoy the game. The sport is usually played on an indoor court with a trampoline goal frame at each end. Each team comprises 7 players and they can score at both ends of the court. In order to score a point, the ball must be thrown by an attacking player, hit the trampoline goal and bounce outside the goal zone (“D”) without being caught by the defending team.", "email": "tants@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/tchoukball.jpg"}, {"name": "Tennis", "category": "Sports CCAs", "bio": "Tennis is a familiar racquet sport that is usually played on outdoor courts between two players (singles) or between two teams of two players each (doubles). An Olympic sport, tennis is popular with many people of all ages regardless of their social background. TP Tennis Teams (Men & Women) compete in the Polytechnic-ITE (POL-ITE) Tennis Games annually.", "email": "senghui@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/tennis.jpg"}, {"name": "Touch Football", "category": "Sports CCAs", "bio": "Players in touch football do not tackle in the traditional physical way, as in rugby. Instead, players use their hands to touch their opponents on any part of the body, clothing, or the ball. Sometimes, referred to as Touch Rugby, it is a safe and growing sport among young men and women in Singapore. It is easy to learn and generally played with two teams of six on-field players. TP Touch Football team competes in Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Touch Football Games annually.", "email": "mdhaffiz@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/touch_football.jpg"}, {"name": "TP Fitness", "category": "Sports CCAs", "bio": "TP Fitness is a group of students passionate about fitness and health. We engage students to make changes in their lifestyle through exercise and advice on nutrition, host fitness events such as Spartan 300 fitness challenges, and support CCAs in strength and conditioning to prepare them for competitions.", "email": "joncsw@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/tp_fitness.jpg"}, {"name": "Track & Field", "category": "Sports CCAs", "bio": "Track and field events are divided into three broad categories: track events, field events and combined events. Track events include sprints, middle and long-distance events, hurdles and relays. Field events are grouped into 2 broad categories, jumps and throws. TP Track & Field Team competes in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Track & Field Championship annually.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/track_n_field.jpg"}, {"name": "Triathlon", "category": "Sports CCAs", "bio": "Triathlon is a multi-sport event with three continuous endurance components. The most common are swimming, cycling and running over various distances. Triathletes compete for the fastest overall completion time. TP Triathlon team competes in external competitions annually.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/triathlon.jpg"}, {"name": "Ultimate Frisbee", "category": "Sports CCAs", "bio": "A game of Ultimate Frisbee is played by two teams with a flying disc on a field. The objective is to score by catching the disc in the opponent’s end zone. Ultimate Frisbee is a fast-paced game, demanding its players to demonstrate sharp throwing and catching skills, along with great stamina and agility. TP Ultimate Frisbee team competes in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Ultimate Frisbee Games annually.", "email": "echok@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/ultimate_frisbee.jpg"}, {"name": "Volleyball", "category": "Sports CCAs", "bio": "Volleyball is played by two teams of six players, separated by a net. By grounding a ball on the other team's court, each team tries to score points. The ball is usually played with the hands or arms, but players can contact the ball with any part of the body. Techniques used in volleyball include spiking and blocking, passing, setting, and specialised player positions and offensive and defensive structures. TP Volleyball (Men & Women) teams compete in the Polytechnic-ITE (POL-ITE) and Institute-Varsity Polytechnic (IVP) Volleyball Games annually.", "email": "tanyh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/volleyball.jpg"}, {"name": "Wakeboarding", "category": "Sports CCAs", "bio": "Towed by a motorboat, a wakeboarder rides a wakeboard over the surface of a body of water. It combines water skiing, snow boarding and surfing techniques. In competitive wakeboarding, the athlete performs a variety of tricks with names, ranging from the Moby Dick to the Scarecrow.", "email": "edwink@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/wakeboarding.jpg"}, {"name": "Water Polo", "category": "Sports CCAs", "bio": "Water Polo is a physically demanding team water sport played over 4 quarters, consisting of two teams of 6 field players and 1 goalkeeper each. Gameplay involves swimming, handling and passing the ball, and players score by throwing the ball into the goal defended by a goalkeeper. TP Water Polo team competes in the Polytechnic-ITE (POL-ITE) Water Polo Games annually.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/sports/water_polo.jpg"}, {"name": "Adventure Club", "category": "P10 Clubs", "bio": "The TP Adventure Club (TPAC) organises exciting outdoor and adventure activities that are open to all TP students. These activities include overseas adventure expeditions, camps, kayaking, cycling, trekking, mountaineering, wildlife appreciation and other campus-wide events suitable for all skill levels.\n\nTPAC organises events throughout the year on top of bi-weekly experiential training sessions.", "email": "edwink@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/adventure_club.jpg"}, {"name": "Applied Science Studies Club", "category": "P10 Clubs", "bio": "Applied Science Studies Club focuses on the personal growth and development of Applied Science students. The various events organised include Freshmen Orientation Programme, Further Education & Career Seminar, Community Sports, Leadership Training Camp, Community Service Projects and many more.", "email": "kengbeng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/applied_science_studies_club.jpg"}, {"name": "Business Studies Club", "category": "P10 Clubs", "bio": "Business Studies Club (BSC) consists of a group of student leaders who plans and organises school-wide activities and events for all students in the School of Business. The activities include leadership camps, community service projects, arts and sports events as well as programmes to enhance the well-being and holistic development of the students.", "email": "willwong@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/business_studies_club.jpg"}, {"name": "Community Service Club", "category": "P10 Clubs", "bio": "\"A Caring Heart & Volunteering Spirit\" is the motto that the TP Community Service Club (CSC) abides by. The CSC aims to instil the spirit of volunteerism in TP students and build a strong base of volunteers to serve the community.  Some of the annual campus-wide volunteering events that it organises include the Walk for Rice @ TP, 3M Step-Up Challenge @ TP and Hair For Hope @ TP. Other long term projects include Volunteering @ MINDs, IMH and YEAH! (Youths Engaged Active and Healthy) Programme @ Tampines West CC.  If you have a heart for the community and want to pay it forward, come join TP CSC as a member now!", "email": "Catherine_ng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/community_service_club.jpg"}, {"name": "Design Studies Club", "category": "P10 Clubs", "bio": "Design Studies Club (DSC) is a group of student leaders who plans and organises school-wide activities and events for all students in the School of Design. Some of the activities and events that they have organized are the Director's Cup, Jam for Lunch, Appreciation Day and Design Year Book.", "email": "gailg@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/design_studies_club.jpg"}, {"name": "Engineering Studies Club", "category": "P10 Clubs", "bio": "Engineering Studies Club (ESC) is the nerve centre of student life in the School of Engineering, and each year, its student leaders take the lead to organise student-centered events such as student camps and the annual Orientation programme for Freshmen, as well as provide student support for school events such as the annual TP Open House.", "email": "chianwei@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/engineering_studies_club.jpg"}, {"name": "Humanities & Social Sciences Studies Club", "category": "P10 Clubs", "bio": "Students of the School of Humanities & Social Sciences (HSS) are members of the Club. This club aims to provide holistic student development beyond the classroom with various activities and programmes organised to help our students to achieve the following mission: \n ", "email": "kuboy@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/humanities_n_social_science_studies_club.jpg"}, {"name": "Informatics & IT Studies Club", "category": "P10 Clubs", "bio": "The Informatics & IT Studies Club (IITSC) represents the students of the School of Informatics & IT (IIT). It organises activities that enrich the student experience, build strong character and leadership skills and support an overall holistic educational experience for students.", "email": "ang.dx@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/informatics_it_studies_club.jpg"}, {"name": "Sports Club", "category": "P10 Clubs", "bio": "Temasek Polytechnic Sports Club (TPSC) is a non-academic constituent club in TP. It is committed to promoting healthy lifestyle and community bonding through the wide array of sports activities for the students to participate and interact with one another. TPSC’s flagship programmes include the Sports & Health Carnival and Cross-Country, which are co-organised with the TP Students’ Union (TPSU), TPSC and other constituent clubs. Other activities organised by TPSC include weekly recreational activities and sub-committee bonding camps etc.", "email": "tanyh@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/sports_club.jpg"}, {"name": "TP Students' Union", "category": "P10 Clubs", "bio": "The Temasek Polytechnic Students’ Union (TPSU) is the largest student organisation in TP. Every TP student is automatically a member. Members are strongly encouraged to participate in the myriad of activities that TPSU has planned for the TP community. TPSU chairs the TP Students' Council, and they work closely with the Constituent Clubs to constantly find ways to engage students and develop a greater sense of belonging.", "email": "darrent@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_students_union.jpg"}, {"name": "Business Ambassadors", "category": "Interest Groups", "bio": "The Business Ambassadors (BA) is a group of students from all Business diplomas trained to undertake the smooth execution of events and functions hosted by the School of Business. Some of the key roles that BAs perform are emceeing, registration, crowd control, presenting and assisting in school talks and outreach exhibitions. The BAs have also participated in events such as Partners-in-Education, TP Graduation Ceremony and TP Open House.", "email": "atyvonne@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/business_ambassadors.jpg"}, {"name": "Design Student Ambassadors", "category": "Interest Groups", "bio": "The Design Student Ambassadors are the face and voice of our School of Design student body. They represent our student body in all outward facing events and activities such as Open House, Design Show, Graduation Show, Outreach programmes etc. They help to usher, guide and lead school tours too.", "email": "julians@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/design_ambassadors.jpg"}, {"name": "Engineering Student Ambassadors", "category": "Interest Groups", "bio": "Engineering (ENG) Student Ambassadors aims to promote Temasek Polytechnic’s School of Engineering to secondary school students, as well as parents through school outreach activities held within and outside TP. Over time, ENG Student Ambassadors develop good people, time management and communication skills through a learning journey in this interest group.", "email": "kumweng@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/engineering_ambassadors.jpg"}, {"name": "Entrepreneurship Group", "category": "Interest Groups", "bio": "The Temasek Polytechnic Entrepreneurship Group aims to provide a platform to identify, nurture and groom students who possess interest and strength in innovation and entrepreneurship. Members will be expected to promote entrepreneurial mindset and organise relevant activities such as talks, workshops, competitions, trips and events for their TP peers.", "email": "leecm@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/entrepreneurship_group.jpg"}, {"name": "Global Connect Student Group", "category": "Interest Groups", "bio": "The Global Connect Student Group (GCSG) harnesses interests in the following topics:\n ", "email": "metrat@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/global_connect_student_group.jpg"}, {"name": "Green Interest Group", "category": "Interest Groups", "bio": "Are you interested to do your part for the environment? Come join the TP Green Interest Group (GIG). At TPGIG, we organise environmental events such as beach clean-ups and hiking trips. These are just some of the events that we do; if you have any event ideas to promote environmental protection or are interested in taking part in our events, we welcome you to our team!", "email": "kohsn@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/green_interest_group.jpg"}, {"name": "IES Student Chapter", "category": "Interest Groups", "bio": "The Institution of Engineers, Singapore (IES) is the premier engineering institution in Singapore and their views are often solicited by the Government to feedback on professional engineering matters. As one of its 11 student chapters in Singapore, TP IES Student Chapter’s objectives are:\n ", "email": "hufang@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/ies_student_chapter.jpg"}, {"name": "Japanese Cultural Group", "category": "Interest Groups", "bio": "At Japanese Cultural Group, we promote Japanese culture and inculcate life skills such as cooking, events management and people management, in a fun and interactive way. Our activities are wide and varied in areas such as Anime and Manga, Arts and Entertainment, Cuisine, Publicity and Research. There is certainly something for you with our numerous unique events and weekly sessions.", "email": "chanlj@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/japanese_cultural_group.jpg"}, {"name": "NYAA Challenge", "category": "Interest Groups", "bio": "The National Youth Achievement Award (NYAA) is a prestigious award that is recognised in many countries including Singapore. TP NYAA Challenge Interest Group aims to help Gold Award Participants (GAPs) in the completion of the NYAA (Gold) by organising activities that meet the following criteria:\n ", "email": "simonctt@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/nyaa_challenge.jpg"}, {"name": "Toastmasters", "category": "Interest Groups", "bio": "TP Toastmasters (TPTM) is a non-profit educational organisation that teaches public speaking and leadership skills to members. In line with our motto “Where Leaders are made”, the TPTM trains members to build on their confidence and conquer their fear of public speaking through giving prepared speeches and evaluations. Good communication skills are also instilled through networking opportunities with other Toastmasters clubs in Singapore.", "email": "deneshs@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/toastmasters.jpg"}, {"name": "TP-BP Mentors", "category": "Interest Groups", "bio": "TP-BP Mentors is a group of students who are passionate about sharing their knowledge and facilitating the learning of the younger children. They currently provide weekly tutoring sessions to children in the schools and family service centres under the worldwide BP (British Petroleum) International Mentoring initiative. Besides this, they also organise interactive games and activities for the children to build their self-esteem and instill confidence in them.", "email": "weeling@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_bp_mentors.jpg"}, {"name": "TP-CD Lionhearters", "category": "Interest Groups", "bio": "The Civil Defence (CD) Lionhearters Club members are youth volunteers under the Singapore Civil Defence Force. This groups provides an avenue for tertiary students to be engaged in civil defence, emergency preparedness and humanitarian missions. Some of the activities that members can look forward to include:\n ", "email": "khimfatt@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_cd_lionhearters.jpg"}, {"name": "TP-Institute of Public Relations of Singapore Student Chapter", "category": "Interest Groups", "bio": "We are an industry-based interest group that seeks to create greater awareness of public relations and the industry among TP students. We also aim to equip TP students with the necessary public relations skills and provide opportunities for exposure to the industry through mentorship programmes and talks.", "email": "kinghar@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/iprs.jpg"}, {"name": "TP Ambassadors", "category": "Interest Groups", "bio": "As a TP Ambassador, you are an official student representative of Temasek Polytechnic (TP). Your role is to boost visibility of the TP brand through your interaction with the public and also your presence on social media fronts. You will be an influencer and you will share and create TP’s brand with our online audience. You will be the face of TP and you will showcase TP as a dynamic institution, ready to welcome students from all walks of life. You will learn media production skills and be involved in content creation projects to help drive engagement with our vibrant TP community. You will, in essence, be trained to market TP to the rest of the world on various fronts.", "email": "nsyairah@TP.EDU.SG", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_ambassadors.jpg"}, {"name": "TP Debates", "category": "Interest Groups", "bio": "Are you intellectually curious? Ever wanted to be more confident in speaking? Do you want to persuade anyone to follow your point of view? If you answered yes to any of the above, TP Debates could be the place for you!", "email": "waifann@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_debates.jpg"}, {"name": "TP International Students Group (TPISG)", "category": "Interest Groups", "bio": "Temasek Polytechnic International Students Group (TPISG) is a student interest group under the International Students Office to meet the Emotional, Social and Practical Needs of our international students and helping them to integrate in the local community. Regular programmes for international and local students are organised to promote friendship, greater awareness and understanding of different countries and their cultures. If you are interested in making friends and engaging with our international and local students through an exciting range of programmes to raise awareness of the rich cultural diversity in TP, join us!", "email": "suityim@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tpisg.jpg"}, {"name": "TP Social Impact Catalyst (SIC)", "category": "Interest Groups", "bio": "TP-SIC (formerly known as TP Enactus) aims to catalyse young leaders of tomorrow through entrepreneurship and innovation to build impactful and sustainable solutions for the world.\n\nAlso known as a Social Entrepreneurship Club, TP-SIC equips members with an entrepreneurial mindset and relevant skills through workshops, organising events (internal and  external), and competitions.", "email": "shin@tpedu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_social_impact_catalyst.jpg"}, {"name": "TP Spirit of Enterprise", "category": "Interest Groups", "bio": "TP-Spirit Of Enterprise (SOE) Student Chapter aims to foster an entrepreneurial spirit and mindset among students in the School of Business and TP.\n\nWe co-create a TP marketplace to influence fellow students to embark on an innovation and entrepreneurial journey. There are sharing sessions and workshops as well as networking sessions with Spirit of Enterprise's mentors and industry start-ups to develop entrepreneurship capabilities.", "email": "johnlow@tp.edu.sg", "contact": null, "profileUrl": null, "coverUrl": "https://www.tp.edu.sg/content/dam/tp-web/images/life-at-tp/cca/p10-interest-clubs/tp_spirit_of_enterprise.jpg"}]