[
  {
    "name": "Astronomy",
    "category": "Special Interests",
    "bio": "With the growing interest in the sciences, the club doesn’t limit its audience to NP students. It also promotes astronomy by teaching astronomy to members of the public. As part of club activities, they venture overseas and organise activities offshore to keep away from city-light interference.",
    "email": "cca_astronomy@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/astronomy.jpg"
  },
  {
    "name": "Board Games Club",
    "category": "Special Interests",
    "bio": "The club aims to promote board games as a recreational activity that boosts social communication and strategic thinking skills. Club sessions are held twice a week, where members play a wide range of board games. The club tries to purchase new games regularly to give members a better gaming experience.",
    "email": "cca_bgames@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/boardgames.jpg"
  },
  {
    "name": "Buddhist Society",
    "category": "Special Interests",
    "bio": "The society strives to introduce Dhamma to NP students in a creative and simple way. The society also provides members with skills to help in daily life, such as the management of stress. The society is open to students of all religion who want to know more about Buddhism.",
    "email": "cca_buddhist@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Campus Crusade for Christ",
    "category": "Special Interests",
    "bio": "The Ngee Ann Campus Crusade for Christ are a vibrant and cheerful group of students who hope to glorify God and help lead in the fulfilment of the Great Commission in every generation. The club aims to launch spiritual student-led movements through Christ-centred multiplying disciples.",
    "email": "cca_crusade@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Catholic Youth Apostolate",
    "category": "Special Interests",
    "bio": "The Catholic Youth Apostolate is a community of Catholics and non-Catholics who journey together through weekly sessions and outings outside of school. The club aims to grow together in faith and to support one another through God and each other. Students of all religion are welcome.",
    "email": "cca_catholic@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "CCA Champions",
    "category": "Special Interests",
    "bio": "The CCA Champions Club (CCA Champs) embraces the spirit of holistic education through active participation in CCAs for a balanced and exciting student life. They provide public relations and marketing assistance for CCAs, as well as help manage combined CCA events. The club also works closely with the Office of Student Development (SDO) to run NP level events.",
    "email": "cca_champions@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/cca_champions.jpg"
  },
  {
    "name": "Chess",
    "category": "Special Interests",
    "bio": "The NP Chess Club began in International Chess and Chinese Chess, eventually extending into Weiqi. Besides weekly training sessions, the club also organises various camps for training, and fun and interaction, as well as the annual NP chess showdown.",
    "email": "cca_chess@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/chess.jpg"
  },
  {
    "name": "Christian Fellowship",
    "category": "Special Interests",
    "bio": "By changing one’s perspectives, purposes and intentions of playing the paper chase, the fellowship hopes to provide students with opportunities to learn more about God and His love, as well as get to know new friends. They also have combined poly Christian Fellowship gatherings and events.",
    "email": "cca_fellowship@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Computer Club",
    "category": "Special Interests",
    "bio": "Members pick up various niche skill-sets such as Photoshop, JavaScript and Python, through the software related workshops conducted by the club. Regular gaming sessions are held every semester and gaming competitions are organised every year. The club also collaborates with companies to co-organise large-scale gaming events, such as Garena Campus League 2014.",
    "email": "cca_computer@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Current Affairs",
    "category": "Special Interests",
    "bio": "The club aims to cultivate interest in current affairs among NP students, by providing a platform to discuss various local and global issues. The club also holds dialogue sessions with national, society and industry leaders, as well as friendly debates and sharing sessions between members.",
    "email": "cca_caffairs@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Muslim Students Society",
    "category": "Special Interests",
    "bio": "Through Islamic and moral values, the society aims to develop young Muslim youths into dynamic, creative and visionary students. The society also organises activities, such as the Quran camp, night cycling, and an Overseas Service Learning Expedition. All students interested in finding out more about Islam are welcome to join.",
    "email": "cca_muslim@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Navigators",
    "category": "Special Interests",
    "bio": "The club aims to guide members in their journey towards being a student disciple of Christ, as well as realising their full potential and purpose in NP.",
    "email": "cca_navigators@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Ninja-Do Kitagaryu",
    "category": "Special Interests",
    "bio": "A unique form of martial arts that focuses on self-defense, ninja-do combines various forms of martial arts techniques from all around the world. In NP, the club focuses on hand and kick techniques, armed and unarmed defences, hand-locks disarming techniques, armed and unarmed katas, and basic sparring techniques",
    "email": "cca_ninjado@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Radio Control",
    "category": "Special Interests",
    "bio": "The Radio Control Club is an avid group of remote control car hobbyists that aims to promote the art of \"drifting\" for all NP students. The club focuses on Scale 1/10 Drifting, which is quite a phenomenon all over the world, especially in countries like Japan, United States, Australia, and Malaysia.​\n​",
    "email": "",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/radio_control.jpg"
  },
  {
    "name": "Shitoryu Karate",
    "category": "Special Interests",
    "bio": "Karate trains the Mind, the Body and the Spirit. This art requires students to be clear of all thoughts and surroundings. The club also boasts a strong coaching foundation, with NP alumni coming back to mentor juniors. Besides training weekly and competing in tournaments, the club also organises leisure activities and engages in community service work.",
    "email": "cca_karate@connect.np.edu.sg",
    "profileUrl": null,
    "coverUrl": null
  },
  {
    "name": "Toastmasters",
    "category": "Special Interests",
    "bio": "The NP Student Toastmasters Club will help you build up your confidence in speaking to a crowd. The club engages in a litany of other events, including 'Speechcraft', an annual competition to determine NP’s best Year 1 speaker, and an annual International Speech and Table Topics Contest.",
    "email": "cca_toastmasters@connect.np.edu.sg​",
    "profileUrl": null,
    "coverUrl": "https://www.np.edu.sg/studentlife/PublishingImages/Pages/ccas/Modal/toastmasters.jpg"
  }
]