[{"name":"Arts Appreciation","category":"Arts & Cultural","bio":"The club conducts regular activities to help members broaden their perspectives through appreciating all art forms, including field trips to museums and basic art classes. By bringing together likeminded people, the Arts Appreciation Club ensures you will always have a buddy to attend that film exhibition or watch a concert with.","email":"cca_aarts@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"B-Boys","category":"Arts & Cultural","bio":"The B-Boy Dance Club performs under the alias of MightyNoMads. The club aims to spread the culture of hip-hop through B-Boying & B-Girling (Break Dancing), as well as to educate and nurture its members in the following four elements of B-Boying: 'Top rock', 'Down rock', freezes, and power moves. Weekly trainings are centred around fun and experiential learning, while improving individuals' technical skills.","email":"cca_bboys@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/bboys.jpg","contact":null},{"name":"Chinese Calligraphy","category":"Arts & Cultural","bio":"The Chinese Calligraphy Club aims to spread awareness of Chinese calligraphy among NP students. Through calligraphy and Chinese painting classes, students get to interact with various nationalities. They also learn to write elegant Chinese script and paint beautiful landscapes. Outstanding pieces of work may even be showcased and submitted for competitions.","email":"cca_calligraphy@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/chinese_calligraphy.jpg","contact":null},{"name":"Chinese Dance","category":"Arts & Cultural","bio":"The Chinese Dance Club focuses on contemporary Chinese Dance and prides itself on being the only Chinese Dance Club among all the polytechnics in Singapore. The club aims to create awareness of this rich cultural art form by giving back to the community through public performances, both on and off campus.","email":"cca_cdance@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/chinese_dance.jpg","contact":null},{"name":"Chinese Drama","category":"Arts & Cultural","bio":"The Chinese Drama Club is also known as the Stage Art Group (SAG), and involves Mandarin and Chinese Stage Art. They aim to expose and nurture acting potential within every member. Members also get involved in major aspects of stage production, from the basics of stage lighting and sound to making props and costumes, and even script writing and make up. The club has performed locally, as well as in Malaysian cities like Johor Bahru, Kuala Lumpur and Penang.","email":"cca_cdrama@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/chinese_drama.jpg","contact":null},{"name":"Chinese Orchestra","category":"Arts & Cultural","bio":"The Chinese Orchestra Club aims to promote awareness of Chinese orchestral music. The orchestra participates actively in performances and takes part in no less than five events each year. The club's conductor, Chuan Joon Hee, is an accomplished Huqin musician in Singapore and is currently a Zhonghu performer in the Singapore Chinese Orchestra.","email":"cca_corchestra@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/chinese_orchestra.jpg","contact":null},{"name":"Concert Band Club","category":"Arts & Cultural","bio":"The club was started to encourage NP students formerly from secondary school bands to continue pursuing their passion in music. The club holds annual concerts, such as \"Ripieno\" with the Strings Club and \"Rondeau\" within the band, to share musical experiences with family, friends, and the NP community. As part of a holistic CCA experience, the club also offers band exchanges, competitions and annual outdoor performances for members to showcase their talents and skills.","email":"cca_concert@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/concert_band.jpg","contact":null},{"name":"Contemporary Dance","category":"Arts & Cultural","bio":"The Contemporary Dance Club, also popularly known as D3, was founded in 2009, and is NP's only contemporary Dance Club. D3 represents the three fundamental elements of a great dancer: dancing with passion, dancing with attitude, and dancing with your body, mind and soul. The club has participated in events such as \"United We Boogie (Singapore)\" and Youthphoria @ SDC.","email":"cca_contemdance@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Dance Sport","category":"Arts & Cultural","bio":"As part of weekly trainings, the DanceSport club incorporates the 5 Latin dances: Chacha, Rhumba, Jive, Samba and Paso Doble. Whether you choose to dance socially or competitively, you'll get to immerse yourself in the art of expression through the sensual allure of DanceSport.","email":"cca_dancesport@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/dance_sport.jpg","contact":null},{"name":"Dragon And Lion Dance","category":"Arts & Cultural","bio":"As Lion Dance is traditionally believed to bring about prosperity and wards off evil spirits, companies hire lion dance troupes for various events and opening ceremonies. NP's club also aims to introduce traditional Chinese culture to the NP community through appearances at ceremonies and events, so members get to experience what the profession entails.","email":"cca_lion@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/dragon_lion_dance.jpg","contact":null},{"name":"English Drama","category":"Arts & Cultural","bio":"Established in the late 80's, the English Drama Club, also known as the Poly Stage F'Actor, comprises highly dedicated and talented members who are passionate about theatre and the arts in general. The club's annual event Musik Art! allows students to showcase their talent by performing original songs ranging from Progressive Rock to Punk Metal.","email":"cca_edrama@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/english_drama.jpg","contact":null},{"name":"Entertainers","category":"Arts & Cultural","bio":"The Entertainers Club hopes to groom performers through events with a platform to showcase their skills and talents. Currently, the club focuses on two entertainment arenas: balloon sculpting and magic. The Magic Arena is open to all hobbyists of Magic, whether experienced or not, and the Balloon Sculpting Arena aims to groom interested parties to be balloon sculptors of high standards.","email":"cca_entertainers@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/entertainers.jpg","contact":null},{"name":"Hip Hop","category":"Arts & Cultural","bio":"More popularly known as New Revolving Age (NRA), the hip hop club nurtures its dancers in various genres, such as Old School Hip Hop, New School Hip Hop, Jazz Funk, Street Jazz, Popping, Locking and Lyrical Jazz. The club is also known for its bi-annual dance production, Danzation.","email":"cca_hiphop@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/hip_hop.jpg","contact":null},{"name":"Indian Cultural Society","category":"Arts & Cultural","bio":"The Indian Cultural Society is a platform for NP students to showcase their talents and reinforce their knowledge of Indian Culture. Every year, the club produces two major productions:","email":"","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/indian_cultural_society.jpg","contact":null},{"name":"Japanese Cultural","category":"Arts & Cultural","bio":"The Japanese Cultural Club in Ngee Ann Polytechnic was founded in 1998. It has since expanded to 6 different divisions in 2018 consisting of Cultural, Comink, Cosplay & J-Fashion, Language, Taiko and Tea Ceremony. Our mission is to teach a variety of Japanese culture to students through slide sessions, games, quizzes, direct exposure of that culture and other fun activities like Japanese school exchanges!","email":"cca_japanese@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/japanese_cultural.jpg","contact":null},{"name":"Korean Cultural","category":"Arts & Cultural","bio":"The Korean Cultural Club (KCC) is the first Korean club in a Singaporean education institution, and has the endorsement and support of the Singapore Korean Embassy. KCC aims to raise awareness about Korean culture and gives NP students the opportunity to learn basic conversational Korean language. The club also comprises a Korean Pop dance group.","email":"cca_korean@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Malay Cultural","category":"Arts & Cultural","bio":"The Malay Cultural Club (MCC) comprises 5 active department: Guys Dikir, Girls Dikir, Warisan Mandling (Dance), Sri Nadi (Drama), and language. Some notable productions of MCC include 'Piala Khatulistiwa' , an annual dikir competition, and 'Dinamis Seni', an annual production that showcases the different departments in MCC.","email":"cca_malay@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/malay_cultural.jpg","contact":null},{"name":"Percussion","category":"Arts & Cultural","bio":"Baracuda Batucada is NP's Percussion club. Since 2004, the samba ensemble has performed in various places, from campus events to larger venues like Orchard Road, Zouk, and even abroad in China. The club is also easily recognised by their hard-thumping rhythms heard around campus.","email":"cca_percussion@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/percussion.jpg","contact":null},{"name":"Photography","category":"Arts & Cultural","bio":"Members will be taught the basics and technical know-how of photography and videography, including the appreciation of aesthetics. Through covering actual events, members get to explore various types of photography, such as Abstract, Portraits, People, Nature, Studio and Events. They also get to dabble in corporate videos and event videography.","email":"cca_photography@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/photography.jpg","contact":null},{"name":"Piano","category":"Arts & Cultural","bio":"The Piano Club is more commonly known as Klavierensemble. The ensemble aims to raise the standard of piano playing in school and hopes to showcase the beauty and versatility of the piano. Members can join either the 'Debussy' group or the less experienced 'Mozart' group.","email":"cca_piano@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/piano.jpg","contact":null},{"name":"Song Composing","category":"Arts & Cultural","bio":"Kick start your music or song writing career with the Song Composing Club. Focusing on English Pop\/Rock music, members will be taught the essentials of song writing, including basic musical and compositional theory. Members are provided with their very own studio, exclusive to the club, for practice sessions and to experiment with music by themselves.","email":"cca_song@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/song_composing.jpg","contact":null},{"name":"Stage Production","category":"Arts & Cultural","bio":"The Poly Stage Production (PSP) aims to expose its members to what lies behind the scenes of stage productions. Members will learn about backstage production and the handling of light and sound systems. PSP has assisted in campus concerts for local and international artists. The club also regularly provides support for campus performances and events of the other CCA clubs.","email":"cca_stage@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Strings","category":"Arts & Cultural","bio":"The Strings Club aims to promote the appreciation of classical music amongst students. The club consists of 2 sections: Strings Ensemble and Guitar Ensemble. To increase the versatility of the club, the Strings Club hopes to adapt and infuse new genres, such as pop, into their music. The club is also actively involved in performing for various school and external events.","email":"cca_strings@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/strings.jpg","contact":null},{"name":"Voices","category":"Arts & Cultural","bio":"Each singer in NP Voices learns to grow and flourish as performers, and gain appreciation of different genres of music in Chorale and A Cappella singing. Every year, NP Voices holds its biggest event: Grandioso. Other regular activities include in-school training camps and mini-concerts. Members can also participate in carolling during the Christmas season every year.","email":"cca_voices@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/voices.jpg","contact":null},{"name":"Aerobics","category":"Sports","bio":"The NP Aerobics Club caters to individuals of all fitness levels, from those who have not tried aerobics to those who already have their own exercise regime. Workouts include cardiovascular training, muscle strengthening and toning exercises, and strength and weight training.","email":"cca_aerobics@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/aerobics.jpeg","contact":null},{"name":"Archery","category":"Sports","bio":"Since its inception in 1998, the Archery Club has won numerous medals in national-level competitions. Particularly skilled and passionate club members have also been a part of Singapore's National Team, or had the opportunity to represent the polytechnic in archery competitions and events.","email":"cca_archery@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/archery.jpg","contact":null},{"name":"Badminton","category":"Sports","bio":"The badminton club provides a great environment for recreational players who want to improve their skills by sparring matches and workouts. The club also provides leadership training, in the form of planning and management. The club is the executive organiser of tournaments, such as the Inter-Club Badminton Competition, as well as Intra-School badminton competitions like NP Open, NP Doubles and Polympics.","email":"cca_badminton@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/badminton.jpg","contact":null},{"name":"Basketball","category":"Sports","bio":"The Ngee Ann Basketball Club is one of the ranked institutes in the Inter-Varsity Championships. Interested members are welcome to join the club for try-outs and training sessions. The club also conducts annual camps and friendly matches outside of training time.","email":"cca_basketball@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/basketball.jpg","contact":null},{"name":"Bowling","category":"Sports","bio":"The Bowling Club aims to develop and train members in bowling. They believe it is a game played with cunning strategy, mental strength, and keen teamwork. The club is open to individuals of any experience level.","email":"cca_bowling@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/bowling.jpg","contact":null},{"name":"Canoeing","category":"Sports","bio":"The Canoeing Club trains intensely in two main groups: Canoe Polo and Canoe Sprinting. The first is a competitive sport that is a mix of basketball and water polo on kayaks. The latter consists of canoe marathons and sprinting competitions that test your strength and endurance. Sprinting boats are built differently from Canoe Polo boats and can achieve greater speeds.","email":"cca_canoeing@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/canoepolo.jpg","contact":null},{"name":"Climbing Club","category":"Sports","bio":"The Climbing Club specialises in adventure racing and rock climbing. Adventure Racing is a multi-discipline endurance \"sport\", with elements from various other adventure sports thrown into the mix. Under Rock Climbing, the club focuses on top rope climbing, speed climbing, bouldering and lead climbing. The club also has their own tower, equipped with climbing lanes, abseil lanes, flying fox, and various low elements.","email":"cca_climbing@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Cue Sports","category":"Sports","bio":"With cue sports, it's all about skills, precision and strategy. Cue sports is a billiard game that is played using 22 balls - one cue ball, 15 red balls, and 6 different coloured balls with different point valuations. Members will learn to master the game and become better competitive or recreational players.","email":"cca_snooker@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/cue_sports.jpg","contact":null},{"name":"Dragon Boat","category":"Sports","bio":"The Dragon Boat Club (NPDB) carries an illustrious history, coupled with a fierce reputation for determination and strength in the Singapore Dragon Boat fraternity. The team participates in international regattas and races, such as the Malaysian Dragon Boat Regatta, and in non-dragon boat events like 'Surf & Sweat' that help to foster team spirit and co-operation.","email":"cca_dragonboat@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Fencing","category":"Sports","bio":"The Fencing Club exercises both the mind and the body. New members have the opportunity choose which weapon group they are most comfortable with. The club participates in the annual Novices and Fencing Singapore (FS) competitions and the Inter-School Fencing Invites.","email":"cca_fencing@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/fencing.jpg","contact":null},{"name":"Floorball","category":"Sports","bio":"Floorball may be one of Singapore's youngest sports, but NP Floorball has a competitive team that takes part in Polytechnic-ITE (POL-ITE) and Inter Varsity Polytechnic (IVP) competitions. These help players gain exposure and experience.The club also organises training and bonding camps and gatherings.","email":"cca_floorball@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/floorball.jpg","contact":null},{"name":"Football","category":"Sports","bio":"NP's Football club gives students the opportunity to develop both as a football player and an individual. They believe in pushing each member to their fullest potential and endeavouring to be the best. The team's passion and hard work has brought them success in the POL-ITE and Institute-Varsity-Polytechnic games.","email":"cca_football@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/football.jpg","contact":null},{"name":"Futsal","category":"Sports","bio":"The sport emphasises more technical footwork and ball skills than soccer, and is a good platform for soccer players to develop ball control, ball handling, and patience. It is a variation of football with similar rules, but is played on a hard court.","email":"cca_futsal@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Handball","category":"Sports","bio":"Handball is a fast-paced and dynamic contact sport that requires athleticism, strength and teamwork. The NP Handball club came in 1st runner up in the POL-ITE Games in 2011 and emerged champions in 2012. The club also offers opportunities for members to polish their skills in regular friendly matches and tournaments.","email":"cca_handball@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/captainsball.jpg","contact":null},{"name":"Hockey","category":"Sports","bio":"The Hockey Club strives to do well in the POL-ITE and Inter-Varsity tournaments every year, and considers that their benchmark in competitive success. The club welcomes students who are interested in picking up hockey for recreation or looking to become more competent sportsmen and sportswomen. They also organise friendly matches with other schools and clubs.","email":"cca_hockey@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Inline Skating","category":"Sports","bio":"The Inline Skating Club is home to a sport of finesse and strength - roller-skating. The two aspects they focus on are slide and slalom. Under slide, skaters position their legs differently to execute various slides, while in slalom, skaters manoeuvre through a line of cones while performing tricks.","email":"cca_inline@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/inline_skating.jpg","contact":null},{"name":"Judo","category":"Sports","bio":"Judo teaches the principle of flexibility in the application of technique. It cultivates self-discipline and respect for oneself and others, by providing the means for concentration and physical coordination, power and flexibility. Training sessions include practising throws and groundwork, learning new techniques, and tandoori (free practice).","email":"cca_judo@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Lifesaving","category":"Sports","bio":"The main aim of the NP Lifesaving corps is to prevent the loss of life and promote the safe participation in water related pursuits. The team trains for internationally recognised lifesaving awards, as well as participates in annual lifesaving competitions like NUS Lifesaving Invitational and SLSS National Lifesaving Championships.","email":"cca_lifeguard@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Muay Thai","category":"Sports","bio":"Requiring dedication and a spirit that embraces learning, the club focuses on San Da and Muay Thai: San Da, also known as Chinese Kickboxing, encourages the use of slamming and wrestling, while Muay Thai, referred to as \"The Art of the Eight Limbs\", extensively utilises elbows and knees.","email":"cca_muaythai@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/muay_thai.jpg","contact":null},{"name":"Netball","category":"Sports","bio":"As the only all-female sports club in NP, the netball club is se parated into two teams: competitive team and recreational. The competitive team trains twice a week to prepare themselves for two key competitions held each year. The recreational team trains once a week, and are encouraged to participate to the fullest in organised friendly matches.","email":"cca_netball@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Outdoor Adventure Club","category":"Sports","bio":"The Outdoor Adventure Club (ODAC) aims to make safe and enjoyable adventure available to the masses. Members with adventurous pursuits are able to polish their technical and non-technical skills through certified courses, skill-based camps and events that are skewed towards developing a strong mental tenacity and physical fitness.","email":"cca_odac@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Rugby","category":"Sports","bio":"The Rugby Club aims to promote rugby as a gentlemen's game to students. The club also attracts top players from various local and national rugby clubs. Besides maintaining the highest standards on the pitch, the Rhinos' camaraderie and fighting spirit is also evident from the various friendly tournaments, camps and bonding sessions.","email":"cca_rugby@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Sailing","category":"Sports","bio":"Through training methods that emphasise team dynamics and good sportsmanship, the club aims to build a sailing team that is dedicated and disciplined. The club also hopes to enrich students' lives by cultivating a strong sense of unity and belonging. They train twice a week to prepare for prestigious races, such as the Pesta Sukan Regatta and Changi Regatta.","email":"cca_sailing@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Silat","category":"Sports","bio":"NP Silat focuses on teaching 'tanding' (match sparring) techniques to its members. However, during season trainings, members will get to choose to join the standing category or the 'seni' (artistic) category for competitions. The club has done the school proud in many competitions, most notably the Inter-Varsity and POL-ITE games.","email":"cca_silat@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/silat.jpg","contact":null},{"name":"Shooting","category":"Sports","bio":"As the sole shooting club among the polytechnics to date, the club aims to pave the way for the Shooting Sport at the Polytechnic level. The club focuses on the 10-meter Air Rifle and 10-meter Air Pistol as classifications.","email":"cca_shooting@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/shooting.jpg","contact":null},{"name":"Softball","category":"Sports","bio":"With a strong emphasis on extensive teamwork, cooperation and communication between members, softball is an ideal sport for those keen on trying out a new and challenging sport. The club also encourages members to share their experience, knowledge and passion for the sport with fellow softball maniacs.","email":"cca_softball@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/softball.jpg","contact":null},{"name":"Squash","category":"Sports","bio":"The squash club gives players both physical and mental training. Numerous drills and types of play are implemented during training sessions to help players improve and increase their fitness levels. The club aims to gather students of all experience levels to play the sport, either for recreation, exercise, or competition.","email":"cca_squash@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Swimming","category":"Sports","bio":"With over 10 years of history, the Ngee Ann Swim Team has established itself as more than just a sports CCA. Training is not just filled with laps of monotonous stroke work, but also aims to develop competitive individuals. Through annual competitions, swimmers hone their skills and experience.","email":"cca_swimming@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/swimming.jpg","contact":null},{"name":"Table Tennis","category":"Sports","bio":"The Table Tennis club aims to help members discover their interest and unleash their fullest potential. Catering to both recreational and competitive players, the latter vie for 10 to 12 positions to represent the school in tournaments. The club also organises camps for members to improve their skills to prepare them physically and mentally for competitions.","email":"cca_tabletennis@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Taekwondo","category":"Sports","bio":"Taekwondo, 태권도 , is a traditional Korean martial art form which combines combat techniques, self-defence, discipline, sport, exercise, meditation and philosophy. Members will get a chance to learn different sparring techniques and utilise it in our contact sparring sessions. Every three months, members go for pattern grading to upgrade their belt level.","email":"cca_tkd@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Tchoukball","category":"Sports","bio":"Tchoukball is a fast-paced invasion sport and is played recreationally and competitively in the club. Members get to experience a unique form of teamwork and pick up ball handling and throwing techniques. They also develop speed, agility and reaction skills while improving fitness levels.","email":"cca_tchouk@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Tennis","category":"Sports","bio":"The Tennis Club consistently serves up the aces in the inter POL-ITE games and varsity tournaments. Members learn to correct common mistakes, sharpen their focus and strengthen their determination. They also master the techniques, improve stamina and cultivate the mental perseverance to sustain a tennis match.","email":"cca_tennis@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Touch Rugby","category":"Sports","bio":"Touch Rugby training is designed to make one confident by imparting good skills and technique. Through regular training sessions, members are able to constantly improve their skills. In addition, to gain experience and exposure, the club organises friendlies with other schools and participates actively in carnivals such as the Winter Touch League (WTL) and the M1 School Rugby Series.","email":"cca_touchrugby@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/touch_rugby.jpg","contact":null},{"name":"Track and Field","category":"Sports","bio":"NP Track and Field trains for a multitude of disciplines, from throws to short distance sprints, and even middle distances. Besides national level competitions like the POL-ITE games and inter-varsity tournaments, the club also participates in local track meets for members to gain competition experience.","email":"cca_track@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Ultimate Frisbee","category":"Sports","bio":"From hand-eye coordination found in basketball, to skilful team-play found in football, to accurate passes found in hockey, ultimate frisbee has it all. The club aims to spread awareness of Ultimate Frisbee, and welcomes students of all experience levels.","email":"cca_frisbee@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Volleyball","category":"Sports","bio":"The volleyball club holds training camps at the end of each year to provide campers a more intensive and detailed training, as well as organises inter-club and inter-school competitions such as Polympics. Aside from the club's recreational aspect, the club also represents NP in inter-varsity competitions.","email":"cca_volleyball@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/volleyball.jpg","contact":null},{"name":"Water Polo","category":"Sports","bio":"Water Polo is a fast-paced sport where tactics, teamwork, an alert mind, hand to eye coordination and fitness work hand in hand. Over the last few years, the Water Polo Club has brought the game to a whole new level in the polytechnic fraternity by winning gold in POL-ITE games.","email":"cca_waterpolo@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Wushu","category":"Sports","bio":"The Wushu club aims to promote the martial arts through opportunities for achievement and self-satisfaction. The club offers its members a good mix of traditional, free-style and international routines, and its members have participated in several Wushu competitions and championships at both tertiary and national level.","email":"cca_wushu@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/wushu.jpg","contact":null},{"name":"Yoga","category":"Sports","bio":"Yoga is a sport that unites and balances your body, mind and breathing. In weekly practices, members will learn asanas (postures), pranayama (ways of breathing) and brush up on knowledge about yoga. The club welcomes students of all religion, gender and background.","email":"cca_yoga@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/yoga.jpg","contact":null},{"name":"Aquatic Diving","category":"Sports","bio":"Aquatic Diving is an art-form that requires hard work and courage to master the techniques to perform various somersaults and twists from a height. Members will develop both athleticism and tenacity in and out of the water. The club provides comprehensive dry-land gymnastics, trampoline training and training in the pool.","email":"cca_aquatic@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"BP-NP Mentoring","category":"Community Service","bio":"Founded to aid academically poor students in primary and secondary school, our members share life experiences with the less privileged students. They aim to grow the students' interest in learning and help them become enterprising young leaders. BP-NP mentors currently serve in seven different institutions around Singapore.","email":"cca_mentoring@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/bp_mentoring.jpg","contact":null},{"name":"Environmental Rangers Club","category":"Community Service","bio":"The club is an environmental group that hopes to instill a sens e of responsibility and passion in our members and the school population towards the environment. Through new and creative ideas to overcome environmental issues, we aim to transform the campus into a greener place to work and play.","email":"cca_erangers@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/environmental_rangers.jpeg","contact":null},{"name":"Food Aid","category":"Community Service","bio":"The Food Aid club aims to help the less fortunate individuals and families who cannot afford to have sufficient food for themselves. We also aim to widen students' perspective on issues surrounding food through our community service programmes, such as liaising with other welfare organisations on fund-raising and food donation drives.","email":"cca_foodaid@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/food_aid.jpg","contact":null},{"name":"Hi! Club","category":"Community Service","bio":"The Hi! Club aims to unite our hearing and non-hearing counterparts. Through sign language courses by dedicated instructors, our members understand the language and gain a passion for our cause. The club also engages in song signing and sign language drama performances for both school-based and external events.","email":"cca_hi@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/hearing_impaired.jpg","contact":null},{"name":"Leo Club","category":"Community Service","bio":"The Leo Club serves a varying audience, from children to the elderly. Through projects and volunteer activities, the club provides development and contribution opportunities for youth, individually and collectively, to give back to the local, national and international community.","email":"cca_leo@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"NP BB Primers","category":"Community Service","bio":"Established under the umbrella of The Boys' Brigade in Singapore, NP BB Primers are given numerous opportunities to develop and nurture their leadership abilities and character, from event planning to taking part in the National Day Parade as crowd motivators. The group also sets up booths around the campus and goes door-to-door in a designated residential area to appeal for food donations.","email":"cca_primers@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/bb_Primers.jpeg","contact":null},{"name":"Red Cross Youth Chapter","category":"Community Service","bio":"Through working with the Singapore Red Cross Society, RCY members get various opportunities to develop their First Aid proficiency through courses. The chapter also organises blood donation drives on a tri-annual basis, and other Community Involvement Programme (CIP) opportunities, allowing members to give back to society.","email":"cca_redcross@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/red_cross.jpg","contact":null},{"name":"Rotaract Club","category":"Community Service","bio":"The Rotaract Club of Ngee Ann Polytechnic is an institution-based service club dedicated towards community service, international understanding, and professional and personal development. The two guiding principles of the club are: 'Service Above Self' and 'Fellowship Through Service'. Rotaractors can expect a variety of activities ranging from fellowship camps to serving the elderly.","email":"cca_rotaract@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Astronomy","category":"Special Interests","bio":"With the growing interest in the sciences, the club doesn't limit its audience to NP students. It also promotes astronomy by teaching astronomy to members of the public. As part of club activities, they venture overseas and organise activities offshore to keep away from city-light interference.","email":"cca_astronomy@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/astronomy.jpg","contact":null},{"name":"Board Games Club","category":"Special Interests","bio":"The club aims to promote board games as a recreational activity that boosts social communication and strategic thinking skills. Club sessions are held twice a week, where members play a wide range of board games. The club tries to purchase new games regularly to give members a better gaming experience.","email":"cca_bgames@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/boardgames.jpg","contact":null},{"name":"Buddhist Society","category":"Special Interests","bio":"The society strives to introduce Dhamma to NP students in a creative and simple way. The society also provides members with skills to help in daily life, such as the management of stress. The society is open to students of all religion who want to know more about Buddhism.","email":"cca_buddhist@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Campus Crusade for Christ","category":"Special Interests","bio":"The Ngee Ann Campus Crusade for Christ are a vibrant and cheerful group of students who hope to glorify God and help lead in the fulfilment of the Great Commission in every generation. The club aims to launch spiritual student-led movements through Christ-centred multiplying disciples.","email":"cca_crusade@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Catholic Youth Apostolate","category":"Special Interests","bio":"The Catholic Youth Apostolate is a community of Catholics and non-Catholics who journey together through weekly sessions and outings outside of school. The club aims to grow together in faith and to support one another through God and each other. Students of all religion are welcome.","email":"cca_catholic@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"CCA Champions","category":"Special Interests","bio":"The CCA Champions Club (CCA Champs) embraces the spirit of holistic education through active participation in CCAs for a balanced and exciting student life. They provide public relations and marketing assistance for CCAs, as well as help manage combined CCA events. The club also works closely with the Office of Student Development (SDO) to run NP level events.","email":"cca_champions@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/cca_champions.jpg","contact":null},{"name":"Chess","category":"Special Interests","bio":"The NP Chess Club began in International Chess and Chinese Chess, eventually extending into Weiqi. Besides weekly training sessions, the club also organises various camps for training, and fun and interaction, as well as the annual NP chess showdown.","email":"cca_chess@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/chess.jpg","contact":null},{"name":"Christian Fellowship","category":"Special Interests","bio":"By changing one's perspectives, purposes and intentions of playing the paper chase, the fellowship hopes to provide students with opportunities to learn more about God and His love, as well as get to know new friends. They also have combined poly Christian Fellowship gatherings and events.","email":"cca_fellowship@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Computer Club","category":"Special Interests","bio":"Members pick up various niche skill-sets such as Photoshop, JavaScript and Python, through the software related workshops conducted by the club. Regular gaming sessions are held every semester and gaming competitions are organised every year. The club also collaborates with companies to co-organise large-scale gaming events, such as Garena Campus League 2014.","email":"cca_computer@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Current Affairs","category":"Special Interests","bio":"The club aims to cultivate interest in current affairs among NP students, by providing a platform to discuss various local and global issues. The club also holds dialogue sessions with national, society and industry leaders, as well as friendly debates and sharing sessions between members.","email":"cca_caffairs@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Muslim Students Society","category":"Special Interests","bio":"Through Islamic and moral values, the society aims to develop young Muslim youths into dynamic, creative and visionary students. The society also organises activities, such as the Quran camp, night cycling, and an Overseas Service Learning Expedition. All students interested in finding out more about Islam are welcome to join.","email":"cca_muslim@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Navigators","category":"Special Interests","bio":"The club aims to guide members in their journey towards being a student disciple of Christ, as well as realising their full potential and purpose in NP.","email":"cca_navigators@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Ninja-Do Kitagaryu","category":"Special Interests","bio":"A unique form of martial arts that focuses on self-defense, ninja-do combines various forms of martial arts techniques from all around the world. In NP, the club focuses on hand and kick techniques, armed and unarmed defences, hand-locks disarming techniques, armed and unarmed katas, and basic sparring techniques","email":"cca_ninjado@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Radio Control","category":"Special Interests","bio":"The Radio Control Club is an avid group of remote control car hobbyists that aims to promote the art of \"drifting\" for all NP students. The club focuses on Scale 1\/10 Drifting, which is quite a phenomenon all over the world, especially in countries like Japan, United States, Australia, and Malaysia.","email":"","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/radio_control.jpg","contact":null},{"name":"Shitoryu Karate","category":"Special Interests","bio":"Karate trains the Mind, the Body and the Spirit. This art requires students to be clear of all thoughts and surroundings. The club also boasts a strong coaching foundation, with NP alumni coming back to mentor juniors. Besides training weekly and competing in tournaments, the club also organises leisure activities and engages in community service work.","email":"cca_karate@connect.np.edu.sg","profileUrl":null,"coverUrl":null,"contact":null},{"name":"Toastmasters","category":"Special Interests","bio":"The NP Student Toastmasters Club will help you build up your confidence in speaking to a crowd. The club engages in a litany of other events, including 'Speechcraft', an annual competition to determine NP's best Year 1 speaker, and an annual International Speech and Table Topics Contest.","email":"cca_toastmasters@connect.np.edu.sg","profileUrl":null,"coverUrl":"https:\/\/www.np.edu.sg\/studentlife\/PublishingImages\/Pages\/ccas\/Modal\/toastmasters.jpg","contact":null}]